Repository: DanielPiana/Proyecto_Compras
Catalog: lib/l10n/app_*.arb
Languages: es

source: Total marked:
es: Total marcado:

source: Total price
es: Precio total

source: Change language
es: Cambiar idioma

source: Dark theme
es: Tema oscuro

# menuSettings
source: Settings menu
es: Menú de ajustes

source: Search...
es: Buscar...

source: Language
es: Idioma

source: Products
es: Productos

source: Shopping List
es: Compra

# receipt
source: Receipts
es: Facturas

source: Recipes
es: Recetas

source: Generate Receipt
es: Generar Factura

source: Delete
es: Eliminar

source: Cancel
es: Cancelar

source: Save
es: Guardar

source: Edit product
es: Editar producto

source: Create product
es: Crear producto

# titleConfirmDialog
source: Confirm delete
es: Confirmar eliminación

# deleteConfirmationSP
source: Are you sure you want to delete this product? This product will only be removed from the shopping list.
es: ¿Estás seguro de que deseas eliminar este producto? Este producto solo se borrará de la lista de la compra

# deleteConfirmationP
source: Are you sure you want to delete this product?
es: ¿Estás seguro de que deseas eliminar este producto?

# deleteConfirmationR
source: Are you sure you want to delete this recepit? The associated products will not be deleted.
es: ¿Estás seguro de que deseas eliminar esta factura? Los productos asociados no se borrarán

source: Name
es: Nombre

source: Description
es: Descripción

source: Price
es: Precio

source: Supermarket
es: Supermercado

source: Select Supermarket
es: Seleccionar Supermercado

# selectSupermarketName
source: New Supermarket name
es: Nombre del nuevo supermercado

# selectSupermarketNameDDB
source: New supermarket
es: Nuevo supermercado

# snackBarRepeatedProduct
source: This product is already on the shopping list
es: Este producto ya está en la lista de compra

# snackBarAddedProduct
source: Product added to the shopping list
es: Producto añadido a la lista de compra

# snackBarErrorAddingProduct
source: Error adding product to the shopping list
es: Error al añadir producto a la lista de compra:

# snackBarReceiptQuantityError
source: There are no marked products to generate a receipt.
es: No hay productos marcados para generar una factura

source: Quantity:
es: Cantidad:

source: Select photo
es: Seleccionar foto

source: Login
es: Entrar

source: Register
es: Registrarse

source: New recipe
es: Nueva receta

# lessThan15
source: Less than 15 minutes
es: Menos de 15 minutos

# lessThan30
source: Less than 30 minutes
es: Menos de 30 minutos

# lessThan45
source: Less than 45 minutes
es: Menos de 45 minutos

# lessThan1h
source: Less than 1 hour
es: Menos de 1 hora

# lessThan1h30
source: Less than 1 hour and 30 minutes
es: Menos de 1hora y 30 minutos

# lessThan2h
source: Less than 2 hours
es: Menos de 2 horas

# moreThan2h
source: More than 2 hours
es: Más de 2 horas

source: Estimated time
es: Tiempo estimado

source: Share
es: Compartir

source: Time
es: Tiempo

source: Select products
es: Selecciona productos

source: No description
es: Sin descripción

source: Close
es: Cerrar

source: Edit name
es: Editar nombre

source: New name
es: Nuevo nombre

source: Save changes?
es: ¿Guardar cambios?

# changes_confirmation
source: You have unsaved changes, What would you like to do?
es: Tienes cambios sin guardar. ¿Qué deseas hacer?

# no_save_exit
source: Exit without saving
es: Salir sin guardar

# save_exit
source: Save and exit
es: Guardar y salir

# first_time_step
source: To add your first step, click here
es: Para añadir tu primer paso haz click aquí

source: Link products
es: Vincular productos

source: No linked products
es: No hay productos asociados

source: Change photo
es: Cambiar foto

source: Edit step
es: Editar paso

# fill_fields
source: Please, fill all available fields
es: Por favor, completa todos los campos

source: Step title
es: Título del paso

source: Step description
es: Descripción del paso

source: Save step
es: Guardar paso

source: Step
es: Paso

source: Title
es: Título

source: Add step
es: Nuevo paso

source: Delete step
es: Eliminar paso

source: Previous
es: Anterior

source: Next
es: Siguiente

source: Finish
es: Finalizar

# product_deleted_ok
source: Product deleted succesfully
es: Producto eliminado correctamente

# product_deleted_error
source: Failed to delete product
es: Error al eliminar producto

source: Success
es: Éxito

# product_updated_ok
source: Product uptdated succesfully
es: Producto actualizado correctamente

# product_updated_error
source: Error updating product
es: Error actualizando producto

# product_created_ok
source: Product created succesfully
es: Producto creado correctamente

# product_created_error
source: Error creating product
es: Error creando producto

source: Warning
es: Aviso

# name_error_message
source: Name is mandatory
es: El nombre es obligatorio

# description_error_message
source: Description is mandatory
es: La descripción es obligatoria

# price_error_message
source: Price must be a valid number
es: El precio debe ser un número válido

# supermarket_error_message
source: You must select a supermarket
es: Debes seleccionar un supermercado

# receipt_deleted_ok
source: Receipt deleted
es: Factura eliminada correctamente

# receipt_deleted_error
source: Error deleting receipt
es: Error al eliminar factura

# receipt_created_ok
source: Receipt created succesfully
es: Factura creada correctamente

# receipt_created_error
source: Error creating receipt
es: Error creando factura

source: Wrong username or password
es: Usuario o contraseña incorrectos

source: Mail
es: Correo

source: Password
es: Contraseña

# recipe_deleted_ok
source: Recipe deleted succesfully
es: Receta borrada correctamente

# recipe_deleted_error
source: Error deleting recipe
es: Error borrando receta

# recipe_created_ok
source: Recipe created succesfully
es: Receta creada correctamente

# recipe_created_error
source: Error creating recipe
es: Error creando receta

# time_error_message
source: Time is mandatory
es: Tiempo es obligatorio

# products_linked_ok
source: Products linked succesfully
es: Productos vinculados correctamente

# products_linked_error
source: Error linking products
es: Error al vincular productos

# data_not_saved
source: Data was not saved
es: Los datos no se han guardado

# data_saved_ok
source: Data saved correctly
es: Los datos se han guardado correctamente

# recipe_updated_ok
source: Recipe updated correctly
es: Receta actualizada correctamente

# recipe_updated_error
source: Error updating recipe
es: Error actualizando receta

# delete_step_confirmation
source: Are you sure you want to delete this step?
es: ¿Estás seguro de borrar este paso?

# login_try_ok
source: Login succesfully
es: Inicio de sesión correcto

# login_try_error
source: Wrong password, try again
es: Contraseña incorrecta, prueba otra vez

# register_try_ok
source: Account created succesfully
es: Cuenta creada correctamente

# register_try_error
source: Error creating account
es: Error al crear cuenta

# register_registered_email
source: This email is already registered. Try logging in
es: Este correo ya está registrado. Intenta iniciar sesión.

source: Unknown error
es: Error desconocido

source: Shopping list
es: Lista de la compra

# share_shopping_list_error
source: Error sharing shopping list
es: Error al compartir la lista de la compra

# copied_list
source: List copied to clipboard
es: Lista copiada al portapapeles

# share_empty_list
source: Select a producto to share
es: Selecciona un producto para compartir

source: Manually create product
es: Crear producto manualmente

source: Scan barcode
es: Escanear código

# barcode_error_message
source: The barcode must be a number
es: El código de barras debe ser un número

# password_short_error
source: Password must contain at least 6 characteres
es: La contraseña debe tener al menos 6 caracteres

# invalid_email
source: Must be a valid email (hotmail or gmail) and end with .com
es: Debe ser un correo válido

# minumun_6_characteres
source: Minimum 6 characteres
es: Mínimo 6 caracteres

# password_matching_error
source: Passwords don't match
es: Las contraseñas no coinciden

# fill_fields_correctly
source: Please, fill the fields correctly
es: Por favor, completa los campos correctamente

# have_an_account
source: Already have an account?
es: ¿Ya tienes una cuenta?

source: Don't have an account?
es: ¿No tienes una cuenta?

# add_product_placeholder_title
source: You don't have any products
es: No tienes productos

# add_product_placeholder_body
source: Here you can manage your products: add, edit, or delete them. Later, you'll use them in your shopping lists, invoices, or recipes
es: Aquí podrás gestionar tus productos: añadir, editar o eliminar. Más tarde los usarás en tus lista de la compra, factura o recetas

# add_product_placeholder_bottom
source: Add a product
es: Añade un producto

# shopping_placeholder_title
source: You don't have any products
es: No tienes productos

# shopping_placeholder_body
source: Here you can manage your shopping list, organized by supermarket. Check or uncheck products, adjust quantities, generate an invoice, or share the list. Products are added from the Products tab, using the + icon on each one
es: Aquí puedes gestionar tu lista de la compra, organizada por supermercado. Marca o desmarca productos, ajusta las cantidades, genera una factura o comparte la lista. Los productos se añaden desde la pestaña de productos, usando el icono + de cada uno.

# shopping_placeholder_top
source: Create an receipt or share
es: Crea una factura o comparte la lista
